import Test from "./types/Test";

export const tests: Test[] = [
  {
    answers: [
      {
        text: "6 уровней;",
      },
      {
        text: "5 уровней;",
      },
      {
        text: "3 уровня;",
      },
      {
        text: "4 уровня;",
      },
      {
        text: "7 уровней;",
      },
    ],
    question:
      "? 1. Международная организация по стандартизации ISO подготовила проект эталонной модели взаимодействия открытых информационных сетей. Она была принята в качестве международного стандарта и имеет несколько уровней, сколько их:",
    currentAnswer: 4,
    id: 1,
  },
  {
    answers: [
      {
        text: "адрес получателя;",
      },
      {
        text: "адрес отправителя;",
      },
      {
        text: "контрольная сумма;",
      },
      {
        text: "данные;",
      },
      {
        text: "все перечисленное;",
      },
    ],
    question:
      "? 2. Фиксированный набор информации, называемый пакетом, независимо от типа ЛВС включает в себя:",
    currentAnswer: 4,
    id: 2,
  },
  {
    answers: [
      {
        text: "К файлам базы данных;",
      },
      {
        text: "К стандартным программам;",
      },
      {
        text: "К внешним устройствам;",
      },
      {
        text: "К удалённым техническим средствам;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 3. Модель файл-сервер обеспечивает доступ:",
    currentAnswer: 0,
    id: 3,
  },
  {
    answers: [
      {
        text: "Тип компьютера;",
      },
      {
        text: "Состав периферийных устройств;",
      },
      {
        text: "Отсутствие дисковода;",
      },
      {
        text: "Отсутствие сетевой карты;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question:
      "? 4. Что делает невозможным подключение компьютера к глобальной сети:",
    currentAnswer: 3,
    id: 4,
  },
  {
    answers: [
      {
        text: "разрядности шины.;",
      },
      {
        text: "производителя шины;",
      },
      {
        text: "частоты шины;",
      },
      {
        text: "поколения компьютера;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 5. От чего зависит пропускная способность шины:",
    currentAnswer: 0,
    id: 5,
  },
  {
    answers: [
      {
        text: "Б. Паскаль.;",
      },
      {
        text: "Г. Лейбниц;",
      },
      {
        text: "Ч. Беббидж;",
      },
      {
        text: "Дж. Фон Нейман;",
      },
      {
        text: "Ада Лавлейс;",
      },
    ],
    question: "? 6. Первые механические вычислительные устройства разработал:",
    currentAnswer: 4,
    id: 6,
  },
  {
    answers: [
      {
        text: "Б. Паскаль;",
      },
      {
        text: "Г. Лейбниц;",
      },
      {
        text: "Ч. Беббидж;",
      },
      {
        text: "Дж. Фон Нейман.;",
      },
      {
        text: "Ада Лавлейс;",
      },
    ],
    question:
      "? 7. Основные принципы функционирования современных ЭВМ сформулировал:",
    currentAnswer: 3,
    id: 7,
  },
  {
    answers: [
      {
        text: "Марк-1;",
      },
      {
        text: "Колосс;",
      },
      {
        text: "Урал;",
      },
      {
        text: "ENIAC.;",
      },
      {
        text: "ЕС ЭВМ;",
      },
    ],
    question: "? 8. Первая действующая ЭВМ называлась:",
    currentAnswer: 4,
    id: 8,
  },
  {
    answers: [
      {
        text: "переходом от транзисторов к интегральным микросхемам.;",
      },
      {
        text: "переходом от ламп к транзисторам;",
      },
      {
        text: "переходом от транзисторов к большим интегральным схемам;",
      },
      {
        text: "переход на новый уровень программирования;",
      },
      {
        text: "переходом от интегральных микросхем к микропроцессору;",
      },
    ],
    question: "? 9. Появление 3-го поколения ЭВМ было обусловлено:",
    currentAnswer: 2,
    id: 9,
  },
  {
    answers: [
      {
        text: "арифметико-логическими машинами;",
      },
      {
        text: "машинами Тьюринга;",
      },
      {
        text: "фон-неймановскими машинами.;",
      },
      {
        text: "релейными машинами;",
      },
      {
        text: "вычислительными;",
      },
    ],
    question: "? 10. Подавляющее большинство современных машин являются:",
    currentAnswer: 2,
    id: 10,
  },
  {
    answers: [
      {
        text: "выполняет арифметические и логические операции, управляет устройствами;",
      },
      {
        text: "управляет процессами передачи данных;",
      },
      {
        text: "осуществляет физическое управление устройствами;",
      },
      {
        text: "контролирует состояние устройств;",
      },
      {
        text: "хранит активные программы и данные;",
      },
    ],
    question: "? 11. Центральный процессор выполняет следующие функции:",
    currentAnswer: 0,
    id: 11,
  },
  {
    answers: [
      {
        text: "память, предназначенная для временного хранения данных и команд, необходимых процессору для выполнения им операций.;",
      },
      {
        text: "микросхема с записанным набором программ;",
      },
      {
        text: "место длительного хранения данных;",
      },
      {
        text: "маленькие схемы памяти, которые вставляются в материнскую плату;",
      },
      {
        text: "участок памяти для хранения скопированной информации;",
      },
    ],
    question: "? 12. Оперативная память компьютера – это:",
    currentAnswer: 0,
    id: 12,
  },
  {
    answers: [
      {
        text: "выполнения арифметических и логических операций;",
      },
      {
        text: "управления процессами передачи данных;",
      },
      {
        text: "физического управления устройствами;",
      },
      {
        text: "контроля состояния устройств;",
      },
      {
        text: "хранения активных программ и данных;",
      },
    ],
    question: "? 13. Оперативная память предназначена для:",
    currentAnswer: 4,
    id: 13,
  },
  {
    answers: [
      {
        text: "Нет верного ответа;",
      },
      {
        text: "разрядность;",
      },
      {
        text: "быстродействие.;",
      },
      {
        text: "тактовая частота;",
      },
      {
        text: "способность обеспечивать работы всех устройств ЭВМ;",
      },
    ],
    question: "? 14. Одной из основных характеристик памяти является:",
    currentAnswer: 2,
    id: 14,
  },
  {
    answers: [
      {
        text: "повышения производительности процессора.;",
      },
      {
        text: "временного хранения часто используемых данных;",
      },
      {
        text: "сохранения, накапливания и воспроизведения информации;",
      },
      {
        text: "для хранения данных и программ, выполняемых в данный момент;",
      },
      {
        text: "закачивания туда игр, музыку, фильмы;",
      },
    ],
    question: "? 15. КЭШ – память (регистровая память) предназначена для:",
    currentAnswer: 0,
    id: 15,
  },
  {
    answers: [
      {
        text: "обозначение протоколов передачи данных в сети Интернет;",
      },
      {
        text: "обозначение оперативной памяти компьютера;",
      },
      {
        text: "обозначение базовой системы ввода-вывода — программы, с которой начинается запуск компьютера.;",
      },
      {
        text: "устройство вывода информации;",
      },
      {
        text: "преобразователь информации;",
      },
    ],
    question: "? 16. BIOS — это:",
    currentAnswer: 2,
    id: 16,
  },
  {
    answers: [
      {
        text: "106;",
      },
      {
        text: "108;",
      },
      {
        text: "216;",
      },
      {
        text: "1024;",
      },
      {
        text: "1010;",
      },
    ],
    question:
      "? 17. Переведите число 1101010 из двоичной системы счисления в десятичную систему счисления:",
    currentAnswer: 0,
    id: 17,
  },
  {
    answers: [
      {
        text: "10000110;",
      },
      {
        text: "1000110;",
      },
      {
        text: "1101011;",
      },
      {
        text: "10000111011;",
      },
      {
        text: "1000110011;",
      },
    ],
    question:
      "? 18. Переведите число 134 из десятичной системы счисления в двоичную систему счисления:",
    currentAnswer: 0,
    id: 18,
  },
  {
    answers: [
      {
        text: "последовательность чисел 1, 2, 3, 4, 5, 6, 7, 8, 9, 0;",
      },
      {
        text: "правила арифметических действий;",
      },
      {
        text: "компьютерная программа для арифметических вычислений;",
      },
      {
        text: "программа для арифметических вычислений;",
      },
      {
        text: "эта знаковая система, в которой числа записываются по определенным правилам, с помощью знаков некоторого алфавита, называемых символами;",
      },
    ],
    question: "? 19. Что такое система счисления:",
    currentAnswer: 4,
    id: 19,
  },
  {
    answers: [
      {
        text: "последовательность числа 1, 2, 3, 4, 5, 6, 7, 8, 9, 0;",
      },
      {
        text: "арифметическая основа ЭВМ;",
      },
      {
        text: "количество символов системы, используемых для записи чисел.;",
      },
      {
        text: "отношение значений единиц соседних разрядов числа;",
      },
      {
        text: "сумма всех цифр позиционной системы счисления;",
      },
    ],
    question: "? 20. Основание системы счисления — это:",
    currentAnswer: 2,
    id: 20,
  },
  {
    answers: [
      {
        text: "9;",
      },
      {
        text: "1010;",
      },
      {
        text: "111;",
      },
      {
        text: "1001;",
      },
      {
        text: "10010;",
      },
    ],
    question: "? 21. Число 9 в двоичной системе запишется как:",
    currentAnswer: 3,
    id: 21,
  },
  {
    answers: [
      {
        text: "100 байт;",
      },
      {
        text: "1000 байт;",
      },
      {
        text: "1024 байт.;",
      },
      {
        text: "10000 бит|;",
      },
      {
        text: "2048 байт;",
      },
    ],
    question: "? 22.  Килобайт — это:",
    currentAnswer: 2,
    id: 22,
  },
  {
    answers: [
      {
        text: "Бит.;",
      },
      {
        text: "Мбайт;",
      },
      {
        text: "Кбайтr;",
      },
      {
        text: "Байт;",
      },
      {
        text: "Гбайт;",
      },
    ],
    question:
      "? 23. Элементарная единица измерения количества информации — это:",
    currentAnswer: 0,
    id: 23,
  },
  {
    answers: [
      {
        text: "RОM;",
      },
      {
        text: "RAM.;",
      },
      {
        text: "CD ROM;",
      },
      {
        text: "PCI;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 24.Назовите английский аналог русской аббревиатуры ОЗУ:",
    currentAnswer: 1,
    id: 24,
  },
  {
    answers: [
      {
        text: "USB;",
      },
      {
        text: "LPT;",
      },
      {
        text: "PCI;",
      },
      {
        text: "CPU;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question:
      "? 25. Какая из приведенных ниже аббревиатур обозначает процессор компьютера:",
    currentAnswer: 3,
    id: 25,
  },
  {
    answers: [
      {
        text: "ленточный накопитель — стример;",
      },
      {
        text: "флэш-память;",
      },
      {
        text: "оперативное запоминающее устройство.;",
      },
      {
        text: "сканер;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question:
      "? 26. Выбрать вариант, где указано устройство, не относящееся к съемным устройствам в ПК:",
    currentAnswer: 0,
    id: 26,
  },
  {
    answers: [
      {
        text: "110100011;",
      },
      {
        text: "10000110;",
      },
      {
        text: "1101011;",
      },
      {
        text: "100111011;",
      },
      {
        text: "1111100;",
      },
    ],
    question:
      "? 27. Переведите число 124 из десятичной системы счисления в двоичную систему счисления:",
    currentAnswer: 4,
    id: 27,
  },
  {
    answers: [
      {
        text: "программное обеспечение;",
      },
      {
        text: "программа отладки;",
      },
      {
        text: "программное оборудование;",
      },
      {
        text: "программное оформление;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 28. Аббревиатура ПО означает:",
    currentAnswer: 0,
    id: 28,
  },
  {
    answers: [
      {
        text: "107;",
      },
      {
        text: "108;",
      },
      {
        text: "216;",
      },
      {
        text: "1024;",
      },
      {
        text: "1010;",
      },
    ],
    question:
      "? 29. Переведите число 1101011 из двоичной системы счисления в десятичную систему счисления:",
    currentAnswer: 0,
    id: 29,
  },
  {
    answers: [
      {
        text: "память, предназначенная для временного хранения данных и команд, необходимых процессору для выполнения им операций;",
      },
      {
        text: "Быстродействующая сверхоперативная память;",
      },
      {
        text: "микросхема с записанным набором программ;",
      },
      {
        text: "место длительного хранения данных.;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 30. Внешнее запоминающее устройство компьютера – это:",
    currentAnswer: 3,
    id: 30,
  },
  {
    answers: [
      {
        text: "повышения производительности процессора.;",
      },
      {
        text: "временного хранения часто используемых данных;",
      },
      {
        text: "сохранения, накапливания и воспроизведения информации;",
      },
      {
        text: "для длительного хранения данных;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 31. КЭШ память (регистровая) предназначена для:",
    currentAnswer: 0,
    id: 31,
  },
  {
    answers: [
      {
        text: "107;",
      },
      {
        text: "108;",
      },
      {
        text: "216;",
      },
      {
        text: "1024;",
      },
      {
        text: "1010;",
      },
    ],
    question:
      "? 32.Переведите число 1101011 из двоичной системы счисления в десятичную систему счисления:",
    currentAnswer: 0,
    id: 32,
  },
  {
    answers: [
      {
        text: "полную систему команд.;",
      },
      {
        text: "сокращенную систему команд;",
      },
      {
        text: "минимальную систему команд;",
      },
      {
        text: "максимальную систему команд;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 33. CISC-процессоры имеют:",
    currentAnswer: 0,
    id: 33,
  },
  {
    answers: [
      {
        text: "полную систему команд;",
      },
      {
        text: "сокращенную систему команд.;",
      },
      {
        text: "минимальную систему команд;",
      },
      {
        text: "максимальную систему команд;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 34.RISC-процессоры имеют:",
    currentAnswer: 1,
    id: 34,
  },
  {
    answers: [
      {
        text: "полную систему команд;",
      },
      {
        text: "сокращенную систему команд;",
      },
      {
        text: "минимальную систему команд.;",
      },
      {
        text: "максимальную систему команд;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 35. MISC-процессоры имеют:",
    currentAnswer: 2,
    id: 35,
  },
  {
    answers: [
      {
        text: "в персональных компьютерах.;",
      },
      {
        text: "в серверах;",
      },
      {
        text: "в супер-ЭВМ;",
      },
      {
        text: "в mainframe;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 36. CISC-процессоры предназначены для работы:",
    currentAnswer: 4,
    id: 36,
  },
  {
    answers: [
      {
        text: "в персональных компьютерах;",
      },
      {
        text: "в серверах.;",
      },
      {
        text: "в супер-эвм;",
      },
      {
        text: "в mainframe;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 37. RISC-процессоры предназначены для работы:",
    currentAnswer: 2,
    id: 37,
  },
  {
    answers: [
      {
        text: "параллельная работа устройств;",
      },
      {
        text: "двоичное кодирование;",
      },
      {
        text: "простота реализации;",
      },
      {
        text: "последовательная работа устройств;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 38. Достоинство централизованной структуры компьютера:",
    currentAnswer: 2,
    id: 38,
  },
  {
    answers: [
      {
        text: "последовательная работа устройств;",
      },
      {
        text: "применение двоичного кодирования;",
      },
      {
        text: "простота реализации;",
      },
      {
        text: "применение адресуемости памяти;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 39. Недостаток централизованной структуры компьютера:",
    currentAnswer: 0,
    id: 39,
  },
  {
    answers: [
      {
        text: "принципе двоичного кодирования;",
      },
      {
        text: "принципе централизованного управления;",
      },
      {
        text: "принципе иерархии управления и построения;",
      },
      {
        text: "принципе применения параллельной работы устройств;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 40. Централизованная структура компьютера основывается на:",
    currentAnswer: 1,
    id: 40,
  },
  {
    answers: [
      {
        text: "Пропускной способности сети;",
      },
      {
        text: "Производительности процессора;",
      },
      {
        text: "Емкости памяти;",
      },
      {
        text: "Все вышеперечисленное;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 41. Эффективность компьютерной сети зависит обычно от:",
    currentAnswer: 0,
    id: 41,
  },
  {
    answers: [
      {
        text: "сетевая карта;",
      },
      {
        text: "модем.;",
      },
      {
        text: "процессор;",
      },
      {
        text: "адаптер;",
      },
      {
        text: "RAMDAK;",
      },
    ],
    question:
      "? 42. Устройство, производящее преобразование аналоговых сигналов в цифровые и обратно, называется:",
    currentAnswer: 4,
    id: 42,
  },
  {
    answers: [
      {
        text: "локальная сеть;",
      },
      {
        text: "корпоративная сеть;",
      },
      {
        text: "глобальная сеть;",
      },
      {
        text: "региональная сеть;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question:
      "? 43. Объединение компьютеров и локальных сетей, расположенных на удаленном расстоянии, для общего использования мировых информационных ресурсов, называется:",
    currentAnswer: 2,
    id: 43,
  },
  {
    answers: [
      {
        text: "принципе двоичного кодирования;",
      },
      {
        text: "принципе централизованного управления;",
      },
      {
        text: "принципе модульности;",
      },
      {
        text: "принципе последовательной работы устройств;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 44. Децентрализованная структура компьютера основывается на:",
    currentAnswer: 2,
    id: 44,
  },
  {
    answers: [
      {
        text: "локальная сеть;",
      },
      {
        text: "корпоративная сеть;",
      },
      {
        text: "глобальная сеть;",
      },
      {
        text: "региональная сеть;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 45. Компьютер подключенный к Интернет, обязательно имеет:",
    currentAnswer: 2,
    id: 45,
  },
  {
    answers: [
      {
        text: "двоичным кодированием;",
      },
      {
        text: "всеми устройствами компьютера;",
      },
      {
        text: "устройствами ввода;",
      },
      {
        text: "устройствами вывода;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question:
      "? 46. Функция устройства управления в централизованной структуре компьютера заключается в управлении:",
    currentAnswer: 1,
    id: 46,
  },
  {
    answers: [
      {
        text: "объём памяти и адресное пространство;",
      },
      {
        text: "быстродействие и разрядность ячеек;",
      },
      {
        text: "объём памяти и быстродействие;",
      },
      {
        text: "объём памяти и частота;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 47. Основными характеристиками ОЗУ являются:",
    currentAnswer: 3,
    id: 47,
  },
  {
    answers: [
      {
        text: "Совокупность средств для передачи информации;",
      },
      {
        text: "Совокупность параллельных изолированных проводов и схем сопряжения;",
      },
      {
        text: "Совокупность устройств для передачи информации;",
      },
      {
        text: "Совокупность программ для передачи информации;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 48. Что такое шина:",
    currentAnswer: 1,
    id: 48,
  },
  {
    answers: [
      {
        text: "нет правильного ответа;",
      },
      {
        text: "локальная сеть;",
      },
      {
        text: "корпоративная сеть;",
      },
      {
        text: "региональная сеть;",
      },
      {
        text: "глобальная сеть;",
      },
    ],
    question: "? 49. Какой вид сетей называется одноранговой:",
    currentAnswer: 0,
    id: 49,
  },
  {
    answers: [
      {
        text: "ОЗУ и ВЗУ;",
      },
      {
        text: "ПЗУ и ВЗУ;",
      },
      {
        text: "ОЗУ и ПЗУ;",
      },
      {
        text: "ОЗУ и видеопамять;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 50. Какие устройства объединяются в основную память:",
    currentAnswer: 2,
    id: 50,
  },
  {
    answers: [
      {
        text: "процессор;",
      },
      {
        text: "адаптер;",
      },
      {
        text: "модем;",
      },
      {
        text: "сетевая карта;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question:
      "? 51. Устройство, выполняющее функции сопряжения компьютеров с каналами связи, называется:",
    currentAnswer: 3,
    id: 51,
  },
  {
    answers: [
      {
        text: "адаптером;",
      },
      {
        text: "коммутатором;",
      },
      {
        text: "сервером;",
      },
      {
        text: "клиентом;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question:
      "? 52. Компьютер, предоставляющий свои ресурсы в пользование другим компьютерам при совместной работе, называется:",
    currentAnswer: 2,
    id: 52,
  },
  {
    answers: [
      {
        text: "четыре байта;",
      },
      {
        text: "один байт;",
      },
      {
        text: "шесть байт;",
      },
      {
        text: "зависит от маски;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 53. Какова длина IP адреса:",
    currentAnswer: 0,
    id: 53,
  },
  {
    answers: [
      {
        text: "только однократное программирование;",
      },
      {
        text: "двукратное программирование;",
      },
      {
        text: "трехкратное программирование;",
      },
      {
        text: "многократное программирование;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 54. В современных ПЗУ возможно:",
    currentAnswer: 3,
    id: 54,
  },
  {
    answers: [
      {
        text: "с помощью языка программирования Си;",
      },
      {
        text: "с помощью специального напряжения;",
      },
      {
        text: "с помощью языка программирования ассемблер;",
      },
      {
        text: "с помощью языка программирования Java;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 55. В современных ПЗУ возможно перепрограммирование:",
    currentAnswer: 4,
    id: 55,
  },
  {
    answers: [
      {
        text: "соглашений;",
      },
      {
        text: "магистралей;",
      },
      {
        text: "паролей;",
      },
      {
        text: "протоколов;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 56. Устройства компьютера соединяются с помощью:",
    currentAnswer: 1,
    id: 56,
  },
  {
    answers: [
      {
        text: "наличие в компьютере автономных функциональных устройств;",
      },
      {
        text: "наличие в каждом устройстве компьютера устройства управления;",
      },
      {
        text: "наличие в каждом устройстве компьютера контроллера;",
      },
      {
        text: "наличие в каждом устройстве компьютера функции обработки;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 57. Модульность построения компьютера означает:",
    currentAnswer: 1,
    id: 57,
  },
  {
    answers: [
      {
        text: "Региональные;",
      },
      {
        text: "Локальные;",
      },
      {
        text: "Глобальные;",
      },
      {
        text: "Региональные;",
      },
      {
        text: "Все вышеперечисленные;",
      },
    ],
    question: "? 58. Классы компьютерных сетей:",
    currentAnswer: 4,
    id: 58,
  },
  {
    answers: [
      {
        text: "совокупностью свойств и характеристик компьютера, важных для пользователя;",
      },
      {
        text: "совокупностью всех свойств, характеристик, связей и принципов компьютера;",
      },
      {
        text: "однородностью и построением памяти компьютера;",
      },
      {
        text: "однородностью элементной базы аппаратного обеслечения;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 59. Архитектура компьютера определяется:",
    currentAnswer: 4,
    id: 59,
  },
  {
    answers: [
      {
        text: "Совокупность специальной аппаратуры;",
      },
      {
        text: "Коммутирующие устройства, которые осуществляют соединение оконечного оборудования;",
      },
      {
        text: "Совокупность цепей передачи данных и коммутирующих устройств, позволяющая осуществлять взаимное соединение оконечного оборудования;",
      },
      {
        text: "для хранения информации, которая не помещается в ОЗУ;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 60. Сеть передачи данных это:",
    currentAnswer: 2,
    id: 60,
  },
  {
    answers: [
      {
        text: "аппаратным обеспечением и приложением;",
      },
      {
        text: "приложением и ОС;",
      },
      {
        text: "аппаратным и программным обеспечениями;",
      },
      {
        text: "между различными приложениями;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 61. BIOS является промежуточным слоем между:",
    currentAnswer: 2,
    id: 61,
  },
  {
    answers: [
      {
        text: "эта связь не реализуется в виде драйверов устройств;",
      },
      {
        text: "драйверы устройств не обеспечивают взаимодействие между аппаратным обеспечением и ОС;",
      },
      {
        text: "драйверы устройств, обычно, не предназначаются для определенной ОС;",
      },
      {
        text: "приложением и ОС;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question:
      "? 62. ОС обращается к аппаратному обеспечению компьютера через BIOS:",
    currentAnswer: 2,
    id: 62,
  },
  {
    answers: [
      {
        text: "аппаратным обеспечением и приложением;",
      },
      {
        text: "приложением и ОС;",
      },
      {
        text: "аппаратным и программным обеспечениями;",
      },
      {
        text: "между различными приложениями;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 63. BIOS является промежуточным слоем между:",
    currentAnswer: 2,
    id: 63,
  },
  {
    answers: [
      {
        text: "материнской плате;",
      },
      {
        text: "адаптере;",
      },
      {
        text: "пульте управления;",
      },
      {
        text: "контроллере;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 64. Системная BIOS находится в микросхемах, установленных на:",
    currentAnswer: 0,
    id: 64,
  },
  {
    answers: [
      {
        text: "обновления ППЗУ;",
      },
      {
        text: "установки изображений;",
      },
      {
        text: "самотестирования POST;",
      },
      {
        text: "форматирования диска;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 65. Системная BIOS содержит одну из следующих программ:",
    currentAnswer: 2,
    id: 65,
  },
  {
    answers: [
      {
        text: "после завершения работы ОС;",
      },
      {
        text: "после изменения конфигурации;",
      },
      {
        text: "после окончания работы антивируса;",
      },
      {
        text: "после окончания тестирования устройств компьютера;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 66. Содержимое CMOS – памяти изменяется:",
    currentAnswer: 1,
    id: 66,
  },
  {
    answers: [
      {
        text: "после завершения работы ОС;",
      },
      {
        text: "после изменения конфигурации;",
      },
      {
        text: "после окончания работы антивируса;",
      },
      {
        text: "после окончания тестирования устройств компьютера;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 67. Содержимое CMOS – памяти изменяется:",
    currentAnswer: 1,
    id: 67,
  },
  {
    answers: [
      {
        text: "специальной программой;",
      },
      {
        text: "программой установки конфигурации;",
      },
      {
        text: "Setup – программой;",
      },
      {
        text: "все ответы верны;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 68. Информация в CMOS-память заносится:",
    currentAnswer: 4,
    id: 68,
  },
  {
    answers: [
      {
        text: "хранение информации, которая неоднократно используется при выполнении программы;",
      },
      {
        text: "хранение активных программ и данных;",
      },
      {
        text: "изменение конфигурации компьютера;",
      },
      {
        text: "чтение и дешифрация команд из основной памяти;",
      },
      {
        text: "управление тестированием компьютера;",
      },
    ],
    question: "? 69. Одной из основных функций микропроцессора является:",
    currentAnswer: 3,
    id: 69,
  },
  {
    answers: [
      {
        text: "VGA;",
      },
      {
        text: "RAM;",
      },
      {
        text: "CD ROM;",
      },
      {
        text: "USB;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 70. CMOS-память — это память:",
    currentAnswer: 4,
    id: 70,
  },
  {
    answers: [
      {
        text: "невысокое быстродействие и минимальное электропотребление;",
      },
      {
        text: "невысокое быстродействие и высокое электропотребление;",
      },
      {
        text: "высокое быстродействие и малое электропотребление;",
      },
      {
        text: "высокое электропотребление и высокое быстродействие;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 71. CMOS-память имеет:",
    currentAnswer: 0,
    id: 71,
  },
  {
    answers: [
      {
        text: "часы реального времени;",
      },
      {
        text: "набор драйверов;",
      },
      {
        text: "загрузчик ОС;",
      },
      {
        text: "набор машинных команд процессора;",
      },
      {
        text: "параметры антивируса;",
      },
    ],
    question: "? 72. CMOS-память может содержать:",
    currentAnswer: 0,
    id: 72,
  },
  {
    answers: [
      {
        text: "на системной плате;",
      },
      {
        text: "в микросхеме CMOS-памяти;",
      },
      {
        text: "в микросхеме кэш-памяти;",
      },
      {
        text: "Не знаю;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question:
      "? 73. Аккумулятор или батарейка, питающая CMOS-память, может находиться:",
    currentAnswer: 0,
    id: 73,
  },
  {
    answers: [
      {
        text: "выполнения арифметических и логических операций;",
      },
      {
        text: "управления процессами передачи данных;",
      },
      {
        text: "физического управления устройствами;",
      },
      {
        text: "контроля состояния устройств;",
      },
      {
        text: "хранения активных программ и данных;",
      },
    ],
    question: "? 74. Оперативная память предназначена для:",
    currentAnswer: 4,
    id: 74,
  },
  {
    answers: [
      {
        text: "Цифровые линии связи;",
      },
      {
        text: "Линии спутниковой связи;",
      },
      {
        text: "Линии телефонной связи;",
      },
      {
        text: "Аналоговая связь;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 75. В основном в локальных сетях используются:",
    currentAnswer: 4,
    id: 75,
  },
  {
    answers: [
      {
        text: "только подтверждениям;",
      },
      {
        text: "только механизму нумерации;",
      },
      {
        text: "подтверждениям и механизму нумерации;",
      },
      {
        text: "Не знаю;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question:
      "? 76.Надежная передача данных по протоколу TCP осуществляется благодаря:",
    currentAnswer: 1,
    id: 76,
  },
  {
    answers: [
      {
        text: "канальный;\t",
      },
      {
        text: "сетевой;",
      },
      {
        text: "транспортный;",
      },
      {
        text: "прикладной;",
      },
      {
        text: "сеансовый;",
      },
    ],
    question:
      "? 77. Уровень сетевых функций, являющийся границей между сетевыми и пользовательскими процессами:",
    currentAnswer: 3,
    id: 77,
  },
  {
    answers: [
      {
        text: "Определяет правила совместного пользования узлами сети физического уровня;",
      },
      {
        text: "Соединяет различные узлы сети между собой;",
      },
      {
        text: "Предоставляет каналы связи для определенных пользователей;",
      },
      {
        text: "способность обеспечивать работы всех устройств компьютера;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 78. Канальный уровень модели OSI:",
    currentAnswer: 0,
    id: 78,
  },
  {
    answers: [
      {
        text: "на физическом;",
      },
      {
        text: "такая проверка в большинстве современных систем не делается;",
      },
      {
        text: "на сеансовом;",
      },
      {
        text: "на канальном;",
      },
      {
        text: "управление тестированием компьютера;",
      },
    ],
    question:
      "? 79. По Вашему мнению, на каком уровне модели OSI происходит проверка доступности среды передачи?:",
    currentAnswer: 3,
    id: 79,
  },
  {
    answers: [
      {
        text: "процессор, внутренняя память, внешняя память, устройства ввода и вывода;",
      },
      {
        text: " арифметическо-логическое устройство, устройство управления, монитор;\t",
      },
      {
        text: "микропроцессор, ВЗУ, ОЗУ, ПЗУ, клавиатура, монитор, принтер, мышь;",
      },
      {
        text: "системный блок, монитор, ОЗУ, клавиатура, мышь, принтер;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question:
      "? 80. Структурно-функциональная схема компьютера включает в себя:",
    currentAnswer: 0,
    id: 80,
  },
  {
    answers: [
      {
        text: "система обеспечивающая создание новых программ;",
      },
      {
        text: "аппаратная часть компьютера;",
      },
      {
        text: "самая популярная система для компьютеров IBM PC;",
      },
      {
        text: "системный блок, монитор, ОЗУ, клавиатура, мышь, принтер;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question: "? 81. Hardware-это:",
    currentAnswer: 1,
    id: 81,
  },
  {
    answers: [
      {
        text: "только программы для подключения к компьютеру новых устройств;",
      },
      {
        text: "программа вспомогательного назначения;",
      },
      {
        text: "программное обеспечение компьютера;",
      },
      {
        text: "хранения исполняемой в данный момент времени программы и данных, с которыми она непосредственно работает; ",
      },
      {
        text: " долговременного хранения информации;",
      },
    ],
    question: "? 82. Software-это:",
    currentAnswer: 1,
    id: 82,
  },
  {
    answers: [
      {
        text: "тактовая частота;",
      },
      {
        text: "тактовый генератор;",
      },
      {
        text: "ОЗУ;",
      },
      {
        text: "CPU;",
      },
      {
        text: "RAMDAC;",
      },
    ],
    question:
      "? 83. Задание ритма при передаче информационных сигналов в компьютере осуществляет:",
    currentAnswer: 1,
    id: 83,
  },
  {
    answers: [
      {
        text: "находиться на жестком диске;",
      },
      {
        text: "быть выведен на печать;",
      },
      {
        text: "находиться в оперативной памяти;",
      },
      {
        text: "USB;",
      },
      {
        text: "В сети;",
      },
    ],
    question:
      "? 84. Для правильной работы периферийного устройства драйвер этого устройства должен:",
    currentAnswer: 0,
    id: 84,
  },
  {
    answers: [
      {
        text: "хранения исполняемой в данный момент времени программы и данных, с которыми она непосредственно работает;",
      },
      {
        text: "быть выведен на печать;",
      },
      {
        text: "находиться в оперативной памяти;",
      },
      {
        text: "запуска программы;",
      },
      {
        text: "долговременного хранения информации;",
      },
    ],
    question: "? 85. Оперативная память необходима для:",
    currentAnswer: 0,
    id: 85,
  },
  {
    answers: [
      {
        text: "ОЗУ;",
      },
      {
        text: "жесткого диска;",
      },
      {
        text: "тактовой частоты; ",
      },
      {
        text: "CPU;",
      },
      {
        text: "GPU;",
      },
    ],
    question: "? 86. Скорость обработки информации в компьютере зависит от:",
    currentAnswer: 0,
    id: 86,
  },
  {
    answers: [
      {
        text: "Кбайт;",
      },
      {
        text: "такт;",
      },
      {
        text: "ГГц;",
      },
      {
        text: "Децибел;",
      },
      {
        text: "Мбайт;",
      },
    ],
    question: "? 87. Укажите единицу измерения ёмкости памяти:",
    currentAnswer: 0,
    id: 87,
  },
  {
    answers: [
      {
        text: "обмена информацией между компьютером и пользователем ;",
      },
      {
        text: "выполнения арифметико-логических операций;",
      },
      {
        text: "улучшения дизайна компьютера;",
      },
      {
        text: "нет верного варианта;",
      },
      {
        text: "для удобства компьютера;",
      },
    ],
    question: "? 88. Периферийные устройства предназначены для:",
    currentAnswer: 0,
    id: 88,
  },
  {
    answers: [
      {
        text: "для долговременного хранения информации после выключения компьютера;",
      },
      {
        text: "для обработки текущей информации;",
      },
      {
        text: "хранения часто изменяющейся информации в процессе решения задачи;",
      },
      {
        text: "для резервного копирования;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question: "? 89. Внешняя память необходима:",
    currentAnswer: 0,
    id: 89,
  },
  {
    answers: [
      {
        text: "герцах;",
      },
      {
        text: "секундах;",
      },
      {
        text: "вольтах;",
      },
      {
        text: "в амперах;",
      },
      {
        text: "в пикселях;",
      },
    ],
    question: "? 90. В чем измеряется частота регенерации монитора:",
    currentAnswer: 0,
    id: 90,
  },
  {
    answers: [
      {
        text: "широкоформатный принтер;",
      },
      {
        text: "широкоформатный сканер;",
      },
      {
        text: "цветной принтер;",
      },
      {
        text: "сканер;",
      },
      {
        text: "ЗD- принтер;",
      },
    ],
    question: "? 91. Что такое плоттер:",
    currentAnswer: 0,
    id: 91,
  },
  {
    answers: [
      {
        text: "количество пикселей по вертикали и по горизонтали;",
      },
      {
        text: "количество пикселей по горизонтали;",
      },
      {
        text: "количество пикселей по вертикали;",
      },
      {
        text: "количество пикселей по диагонали;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question: "? 92. Разрешение монитора - это:",
    currentAnswer: 0,
    id: 92,
  },
  {
    answers: [
      {
        text: "исполняемая в данный момент времени программа и данные, с которыми она непосредственно работает;",
      },
      {
        text: "информация, присутствие которой постоянно необходимо для работы компьютера) ;",
      },
      {
        text: "хранится информация независимо от того работает компьютер или нет;",
      },
      {
        text: "для резервного копирования;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question: "? 93. ОЗУ-это память, в которой хранится:",
    currentAnswer: 0,
    id: 93,
  },
  {
    answers: [
      {
        text: "ввод-вывод информации;",
      },
      {
        text: "обработку информации;",
      },
      {
        text: "хранение информации;",
      },
      {
        text: "для копирования;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question: "? 94. Какую функцию выполняют периферийные устройства:",
    currentAnswer: 0,
    id: 94,
  },
  {
    answers: [
      {
        text: "описание устройства и принципов работы компьютера, достаточное для понимания пользователя);",
      },
      {
        text: "техническое описание деталей устройств компьютера;",
      },
      {
        text: "описание программного обеспечения для работы компьютера;",
      },
      {
        text: "нет верного варианта;",
      },
      {
        text: "описание программного обеспечения;",
      },
    ],
    question: "? 95. Что такое архитектура компьютера:",
    currentAnswer: 0,
    id: 95,
  },
  {
    answers: [
      {
        text: "универсальное, электронное устройство для хранения, обработки и передачи информации;",
      },
      {
        text: "универсальное устройство для записи и чтения информации;",
      },
      {
        text: "электронное устройство для обработки информации;",
      },
      {
        text: "устройство обработки и передачи информации;",
      },
      {
        text: "нет верного варианта; ",
      },
    ],
    question: "? 96. Что такое компьютер:",
    currentAnswer: 0,
    id: 96,
  },
  {
    answers: [
      {
        text: "интегральная микросхема, которая выполняет поступающие на её вход команды (например, вычисление) и управляет работой машины;",
      },
      {
        text: "устройство для хранения той информации, которая часто используется в работе;",
      },
      {
        text: "устройство для вывода алфавитно-цифровых данных;",
      },
      {
        text: "устройство обработки и передачи информации;",
      },
      {
        text: "нет верного варианта; ",
      },
    ],
    question: "? 97. Микропроцессор-это:",
    currentAnswer: 0,
    id: 97,
  },
  {
    answers: [
      {
        text: "выполнять команды одной программы в данный момент;",
      },
      {
        text: "выполнять арифметико-логические операции;",
      },
      {
        text: "подключать периферийные устройства к магистрали;",
      },
      {
        text: "устройство обработки и передачи информации;",
      },
      {
        text: "нет верного варианта; ",
      },
    ],
    question: "? 98. Назначение процессора:",
    currentAnswer: 0,
    id: 98,
  },
  {
    answers: [
      {
        text: "контроллера;",
      },
      {
        text: "утилиты;",
      },
      {
        text: "драйвера;",
      },
      {
        text: "порт;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question:
      "? 99. Подключение отдельных периферийных устройств компьютера к магистрали на физическом уровне возможно с помощью:",
    currentAnswer: 0,
    id: 99,
  },
  {
    answers: [
      {
        text: "сетевая карта;",
      },
      {
        text: "интерфейс;",
      },
      {
        text: "жесткий диск;",
      },
      {
        text: "порт;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question:
      "? 100. Какое устройство служит для обмена информацией между компьютерами:",
    currentAnswer: 0,
    id: 100,
  },
  {
    answers: [
      {
        text: "SATA;",
      },
      {
        text: "LIP;",
      },
      {
        text: "COM;",
      },
      {
        text: "USB;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question:
      "? 101. По какой шине к южному мосту подключаются устройства внешней памяти:",
    currentAnswer: 0,
    id: 101,
  },
  {
    answers: [
      {
        text: "исчезает из оперативной памяти;",
      },
      {
        text: "стирается на «жестком диске»;",
      },
      {
        text: "исчезает из постоянного запоминающего устройства;",
      },
      {
        text: "удаляется с HDD;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question: "? 102. Что происходит с информацией при отключении компьютера:",
    currentAnswer: 0,
    id: 102,
  },
  {
    answers: [
      {
        text: "оперативную память;",
      },
      {
        text: "дисковод;",
      },
      {
        text: "мышь;",
      },
      {
        text: "HDD;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question:
      "? 103. Персональный компьютер не будет функционировать, если отключить:",
    currentAnswer: 0,
    id: 103,
  },
  {
    answers: [
      {
        text: "модем;",
      },
      {
        text: "сетевая карта ;",
      },
      {
        text: "флешка;",
      },
      {
        text: "порт;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question:
      "? 104. Какое устройство позволяет создавать локальную сеть, соединяя компьютеры между собой и выходить в интернет:",
    currentAnswer: 0,
    id: 104,
  },
  {
    answers: [
      {
        text: "набор микросхем материнской платы для обеспечения работы процессора с памятью и внешними устройствами;",
      },
      {
        text: "универсальное, электронное, программно-управляемое устройство для хранения, обработки и передачи информации;",
      },
      {
        text: "универсальное устройство для передачи информации;",
      },
      {
        text: "быстрая, полупроводниковая, энергонезависимая память;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question: "? 105. Что такое чипсет:",
    currentAnswer: 0,
    id: 105,
  },
  {
    answers: [
      {
        text: "сложная многослойная печатная плата, на которой устанавливаются основные компоненты персонального компьютера;",
      },
      {
        text: "быстрая, полупроводниковая, энергонезависимая память; ",
      },
      {
        text: "плата, обеспечивающая компьютер;",
      },
      {
        text: "порт;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question: "? 106. Материнская плата - это:",
    currentAnswer: 0,
    id: 106,
  },
  {
    answers: [
      {
        text: "процессор и оперативная память ;",
      },
      {
        text: "ОЗУ;",
      },
      {
        text: "жесткий диск;",
      },
      {
        text: "порт;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question:
      "? 107. Что подключается к магистрали, которая представляет собой три различные шины:",
    currentAnswer: 0,
    id: 107,
  },
  {
    answers: [
      {
        text: "фон Нейманом;",
      },
      {
        text: "фон Бисмарком;",
      },
      {
        text: "фон Ньюманом;",
      },
      {
        text: "фон Ньютон;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question:
      "? 108. В основу построения большинства компьютеров положены принципы, сформулированные:",
    currentAnswer: 0,
    id: 108,
  },
  {
    answers: [
      {
        text: "источник питания;",
      },
      {
        text: "источник функционирования;",
      },
      {
        text: "источник памяти;",
      },
      {
        text: "порт ОЗУ;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question:
      "? 109. Блок, содержащий системы автономного и сетевого питания компьютера:",
    currentAnswer: 0,
    id: 109,
  },
  {
    answers: [
      {
        text: "точка изображения;",
      },
      {
        text: "несколько точек, соединенных в пучок;",
      },
      {
        text: "электрон;",
      },
      {
        text: "матрица;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question: "? 110. Пиксель - это:",
    currentAnswer: 0,
    id: 110,
  },
  {
    answers: [
      {
        text: "Электронно - вычислительная машина;",
      },
      {
        text: "Персональный компьютер;",
      },
      {
        text: "Архитектура ЭВМ;",
      },
      {
        text: "Супер ЭВМ;",
      },
      {
        text: "нет верного варианта;",
      },
    ],
    question:
      "? 111. Комплекс технических средств, предназначенных для автоматической обработки информации в процессе решения вычислительных и информационных задач это:",
    currentAnswer: 0,
    id: 111,
  },
  {
    answers: [
      {
        text: "Быстродействие, производительность, емкость запоминающих устройств;",
      },
      {
        text: "Емкость оперативной памяти (ОЗУ) и внешней памяти (ВЗУ);",
      },
      {
        text: "Архитектура ЭВМ;",
      },
      {
        text: "Надежность, точность, достоверность;",
      },
      {
        text: "Все варианты верны;",
      },
    ],
    question: "? 112. К основным характеристикам ЭВМ относятся:",
    currentAnswer: 4,
    id: 112,
  },
  {
    answers: [
      {
        text: "Оперативная и постоянная;",
      },
      {
        text: "Оперативная и кэш- память;",
      },
      {
        text: "буферная память;",
      },
      {
        text: "Постоянная и кэш-память;",
      },
      {
        text: "Все варианты верны;",
      },
    ],
    question: "? 113. Внутренняя память компьютера делится на:",
    currentAnswer: 4,
    id: 113,
  },
  {
    answers: [
      {
        text: "ЭВМ;",
      },
      {
        text: "Процессор;",
      },
      {
        text: "Оперативная память;",
      },
      {
        text: "Жесткий диск;",
      },
      {
        text: "Все варианты верны;",
      },
    ],
    question:
      "? 114. Устройство, отвечающее за выполнение арифметических, логических операций и операций управления, записанных в машинном коде:",
    currentAnswer: 1,
    id: 114,
  },
  {
    answers: [
      {
        text: "Тип микропроцессора, быстродействие;",
      },
      {
        text: "Тактовая частота, разрядность;",
      },
      {
        text: "Тип микропроцессора, быстродействие микропроцессора, тактовая частота микропроцессора, разрядность процессора;",
      },
      {
        text: "по объему;",
      },
      {
        text: "Все варианты верны;",
      },
    ],
    question: "? 115. К основным характеристикам микропроцессора относится:",
    currentAnswer: 1,
    id: 115,
  },
  {
    answers: [
      {
        text: "разрядности шины.;",
      },
      {
        text: "производителя шины;",
      },
      {
        text: "частоты шины;",
      },
      {
        text: "поколения компьютера;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 116. От чего зависит пропускная способность шины:",
    currentAnswer: 0,
    id: 116,
  },
  {
    answers: [
      {
        text: "Б. Паскаль.;",
      },
      {
        text: "Г. Лейбниц;",
      },
      {
        text: "Ч. Беббидж;",
      },
      {
        text: "Дж. Фон Нейман;",
      },
      {
        text: "Ада Лавлейс;",
      },
    ],
    question:
      "? 117. Первые механические вычислительные устройства разработал:",
    currentAnswer: 4,
    id: 117,
  },
  {
    answers: [
      {
        text: "Б. Паскаль;",
      },
      {
        text: "Г. Лейбниц;",
      },
      {
        text: "Ч. Беббидж;",
      },
      {
        text: "Дж. Фон Нейман.;",
      },
      {
        text: "Ада Лавлейс;",
      },
    ],
    question:
      "? 118. Основные принципы функционирования современных ЭВМ сформулировал:",
    currentAnswer: 3,
    id: 118,
  },
  {
    answers: [
      {
        text: "Марк-1;",
      },
      {
        text: "Колосс;",
      },
      {
        text: "Урал;",
      },
      {
        text: "ENIAC.;",
      },
      {
        text: "ЕС ЭВМ;",
      },
    ],
    question: "? 119. Первая действующая ЭВМ называлась:",
    currentAnswer: 4,
    id: 119,
  },
  {
    answers: [
      {
        text: "переходом от транзисторов к интегральным микросхемам.;",
      },
      {
        text: "переходом от ламп к транзисторам;",
      },
      {
        text: "переходом от транзисторов к большим интегральным схемам;",
      },
      {
        text: "переход на новый уровень программирования;",
      },
      {
        text: "переходом от интегральных микросхем к микропроцессору;",
      },
    ],
    question: "? 120. Появление 3-го поколения ЭВМ было обусловлено:",
    currentAnswer: 2,
    id: 120,
  },
  {
    answers: [
      {
        text: "арифметико-логическими машинами;",
      },
      {
        text: "машинами Тьюринга;",
      },
      {
        text: "фон-неймановскими машинами.;",
      },
      {
        text: "релейными машинами;",
      },
      {
        text: "вычислительными;",
      },
    ],
    question: "? 121. Подавляющее большинство современных машин являются:",
    currentAnswer: 2,
    id: 121,
  },
  {
    answers: [
      {
        text: "выполняет арифметические и логические операции, управляет устройствами;",
      },
      {
        text: "управляет процессами передачи данных;",
      },
      {
        text: "осуществляет физическое управление устройствами;",
      },
      {
        text: "контролирует состояние устройств;",
      },
      {
        text: "хранит активные программы и данные;",
      },
    ],
    question: "? 122. Центральный процессор выполняет следующие функции:",
    currentAnswer: 0,
    id: 122,
  },
  {
    answers: [
      {
        text: "память, предназначенная для временного хранения данных и команд, необходимых процессору для выполнения им операций.;",
      },
      {
        text: "микросхема с записанным набором программ;",
      },
      {
        text: "место длительного хранения данных;",
      },
      {
        text: "маленькие схемы памяти, которые вставляются в материнскую плату;",
      },
      {
        text: "участок памяти для хранения скопированной информации;",
      },
    ],
    question: "? 123. Оперативная память компьютера – это:",
    currentAnswer: 0,
    id: 123,
  },
  {
    answers: [
      {
        text: "выполнения арифметических и логических операций;",
      },
      {
        text: "управления процессами передачи данных;",
      },
      {
        text: "физического управления устройствами;",
      },
      {
        text: "контроля состояния устройств;",
      },
      {
        text: "хранения активных программ и данных;",
      },
    ],
    question: "? 124. Оперативная память предназначена для:",
    currentAnswer: 4,
    id: 124,
  },
  {
    answers: [
      {
        text: "Нет верного ответа;",
      },
      {
        text: "разрядность;",
      },
      {
        text: "быстродействие.;",
      },
      {
        text: "тактовая частота;",
      },
      {
        text: "способность обеспечивать работы всех устройств ЭВМ;",
      },
    ],
    question: "? 125. Одной из основных характеристик памяти является:",
    currentAnswer: 2,
    id: 125,
  },
  {
    answers: [
      {
        text: "повышения производительности процессора.;",
      },
      {
        text: "временного хранения часто используемых данных;",
      },
      {
        text: "сохранения, накапливания и воспроизведения информации;",
      },
      {
        text: "для хранения данных и программ, выполняемых в данный момент;",
      },
      {
        text: "закачивания туда игр, музыку, фильмы;",
      },
    ],
    question: "? 126. КЭШ – память (регистровая память) предназначена для:",
    currentAnswer: 0,
    id: 126,
  },
  {
    answers: [
      {
        text: "ОЗУ и ВЗУ;",
      },
      {
        text: "ПЗУ и ВЗУ;",
      },
      {
        text: "ОЗУ и ПЗУ;",
      },
      {
        text: "ОЗУ и видеопамять;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 127. Какие устройства объединяются в основную память:",
    currentAnswer: 2,
    id: 127,
  },
  {
    answers: [
      {
        text: "процессор;",
      },
      {
        text: "адаптер;",
      },
      {
        text: "модем;",
      },
      {
        text: "сетевая карта;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question:
      "? 128. Устройство, выполняющее функции сопряжения компьютеров с каналами связи, называется:",
    currentAnswer: 3,
    id: 128,
  },
  {
    answers: [
      {
        text: "адаптером;",
      },
      {
        text: "коммутатором;",
      },
      {
        text: "сервером;",
      },
      {
        text: "клиентом;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question:
      "? 129. Компьютер, предоставляющий свои ресурсы в пользование другим компьютерам при совместной работе, называется:",
    currentAnswer: 2,
    id: 129,
  },
  {
    answers: [
      {
        text: "четыре байта;",
      },
      {
        text: "один байт;",
      },
      {
        text: "шесть байт;",
      },
      {
        text: "зависит от маски;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 130. Какова длина IP адреса:",
    currentAnswer: 0,
    id: 130,
  },
  {
    answers: [
      {
        text: "только однократное программирование;",
      },
      {
        text: "двукратное программирование;",
      },
      {
        text: "трехкратное программирование;",
      },
      {
        text: "многократное программирование;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 131. В современных ПЗУ возможно:",
    currentAnswer: 3,
    id: 131,
  },
  {
    answers: [
      {
        text: "с помощью языка программирования Си;",
      },
      {
        text: "с помощью специального напряжения;",
      },
      {
        text: "с помощью языка программирования ассемблер;",
      },
      {
        text: "с помощью языка программирования Java;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 132. В современных ПЗУ возможно перепрограммирование:",
    currentAnswer: 4,
    id: 132,
  },
  {
    answers: [
      {
        text: "соглашений;",
      },
      {
        text: "магистралей;",
      },
      {
        text: "паролей;",
      },
      {
        text: "протоколов;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 133. Устройства компьютера соединяются с помощью:",
    currentAnswer: 1,
    id: 133,
  },
  {
    answers: [
      {
        text: "наличие в компьютере автономных функциональных устройств;",
      },
      {
        text: "наличие в каждом устройстве компьютера устройства управления;",
      },
      {
        text: "наличие в каждом устройстве компьютера контроллера;",
      },
      {
        text: "наличие в каждом устройстве компьютера функции обработки;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 134. Модульность построения компьютера означает:",
    currentAnswer: 1,
    id: 134,
  },
  {
    answers: [
      {
        text: "Региональные;",
      },
      {
        text: "Локальные;",
      },
      {
        text: "Глобальные;",
      },
      {
        text: "Региональные;",
      },
      {
        text: "Все вышеперечисленные;",
      },
    ],
    question: "? 135. Классы компьютерных сетей:",
    currentAnswer: 4,
    id: 135,
  },
  {
    answers: [
      {
        text: "совокупностью свойств и характеристик компьютера, важных для пользователя;",
      },
      {
        text: "совокупностью всех свойств, характеристик, связей и принципов компьютера;",
      },
      {
        text: "однородностью и построением памяти компьютера;",
      },
      {
        text: "однородностью элементной базы аппаратного обеслечения;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 136. Архитектура компьютера определяется:",
    currentAnswer: 4,
    id: 136,
  },
  {
    answers: [
      {
        text: "Совокупность специальной аппаратуры;",
      },
      {
        text: "Коммутирующие устройства, которые осуществляют соединение оконечного оборудования;",
      },
      {
        text: "Совокупность цепей передачи данных и коммутирующих устройств, позволяющая осуществлять взаимное соединение оконечного оборудования;",
      },
      {
        text: "для хранения информации, которая не помещается в ОЗУ;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 137. Сеть передачи данных это:",
    currentAnswer: 2,
    id: 137,
  },
  {
    answers: [
      {
        text: "аппаратным обеспечением и приложением;",
      },
      {
        text: "приложением и ОС;",
      },
      {
        text: "аппаратным и программным обеспечениями;",
      },
      {
        text: "между различными приложениями;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 138. BIOS является промежуточным слоем между:",
    currentAnswer: 0,
    id: 138,
  },
  {
    answers: [
      {
        text: "эта связь не реализуется в виде драйверов устройств;",
      },
      {
        text: "драйверы устройств не обеспечивают взаимодействие между аппаратным обеспечением и ОС;",
      },
      {
        text: "драйверы устройств, обычно, не предназначаются для определенной ОС;",
      },
      {
        text: "приложением и ОС;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question:
      "? 139. ОС обращается к аппаратному обеспечению компьютера через BIOS:",
    currentAnswer: 2,
    id: 139,
  },
  {
    answers: [
      {
        text: "аппаратным обеспечением и приложением;",
      },
      {
        text: "приложением и ОС;",
      },
      {
        text: "аппаратным и программным обеспечениями;",
      },
      {
        text: "между различными приложениями;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 140. BIOS является промежуточным слоем между:",
    currentAnswer: 2,
    id: 140,
  },
  {
    answers: [
      {
        text: "материнской плате;",
      },
      {
        text: "адаптере;",
      },
      {
        text: "пульте управления;",
      },
      {
        text: "контроллере;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question:
      "? 141. Системная BIOS находится в микросхемах, установленных на:",
    currentAnswer: 0,
    id: 141,
  },
  {
    answers: [
      {
        text: "обновления ППЗУ;",
      },
      {
        text: "установки изображений;",
      },
      {
        text: "самотестирования POST;",
      },
      {
        text: "форматирования диска;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 142. Системная BIOS содержит одну из следующих программ:",
    currentAnswer: 2,
    id: 142,
  },
  {
    answers: [
      {
        text: "VGA;",
      },
      {
        text: "RAM;",
      },
      {
        text: "CD ROM;",
      },
      {
        text: "USB;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 143. CMOS-память — это память:",
    currentAnswer: 4,
    id: 143,
  },
  {
    answers: [
      {
        text: "невысокое быстродействие и минимальное электропотребление;",
      },
      {
        text: "невысокое быстродействие и высокое электропотребление;",
      },
      {
        text: "высокое быстродействие и малое электропотребление;",
      },
      {
        text: "высокое электропотребление и высокое быстродействие;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question: "? 144. CMOS-память имеет:",
    currentAnswer: 0,
    id: 144,
  },
  {
    answers: [
      {
        text: "часы реального времени;",
      },
      {
        text: "набор драйверов;",
      },
      {
        text: "загрузчик ОС;",
      },
      {
        text: "набор машинных команд процессора;",
      },
      {
        text: "параметры антивируса;",
      },
    ],
    question: "? 145. CMOS-память может содержать:",
    currentAnswer: 0,
    id: 145,
  },
  {
    answers: [
      {
        text: "на системной плате;",
      },
      {
        text: "в микросхеме CMOS-памяти;",
      },
      {
        text: "в микросхеме кэш-памяти;",
      },
      {
        text: "Не знаю;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question:
      "? 146. Аккумулятор или батарейка, питающая CMOS-память, может находиться:",
    currentAnswer: 0,
    id: 146,
  },
  {
    answers: [
      {
        text: "выполнения арифметических и логических операций;",
      },
      {
        text: "управления процессами передачи данных;",
      },
      {
        text: "физического управления устройствами;",
      },
      {
        text: "контроля состояния устройств;",
      },
      {
        text: "хранения активных программ и данных;",
      },
    ],
    question: "? 147. Оперативная память предназначена для:",
    currentAnswer: 4,
    id: 147,
  },
  {
    answers: [
      {
        text: "Цифровые линии связи;",
      },
      {
        text: "Линии спутниковой связи;",
      },
      {
        text: "Линии телефонной связи;",
      },
      {
        text: "Аналоговая связь;",
      },
      {
        text: "Нет верного ответа;",
      },
    ],
    question: "? 148. В основном в локальных сетях используются:",
    currentAnswer: 4,
    id: 148,
  },
  {
    answers: [
      {
        text: "только подтверждениям;",
      },
      {
        text: "только механизму нумерации;",
      },
      {
        text: "подтверждениям и механизму нумерации;",
      },
      {
        text: "Не знаю;",
      },
      {
        text: "нет правильного ответа;",
      },
    ],
    question:
      "? 149.Надежная передача данных по протоколу TCP осуществляется благодаря:",
    currentAnswer: 1,
    id: 149,
  },
  {
    answers: [
      {
        text: "адрес получателя;",
      },
      {
        text: "адрес отправителя;",
      },
      {
        text: "контрольная сумма;",
      },
      {
        text: "данные;",
      },
      {
        text: "все перечисленное;",
      },
    ],
    question:
      "? 150. Фиксированный набор информации, называемый пакетом, независимо от типа ЛВС включает в себя:",
    currentAnswer: 4,
    id: 150,
  },
];
